<?xml version="1.0" ?>
<net batch="1" name="frozen-model" version="5">
	<layers>
		<layer id="0" name="image" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>368</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="MobilenetV2/Conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>368</dim>
					<dim>432</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="864"/>
				<biases offset="864" size="32"/>
			</blobs>
		</layer>
		<layer id="2" name="MobilenetV2/Conv/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="MobilenetV2/expanded_conv/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
			<blobs>
				<weights offset="896" size="288"/>
				<biases offset="1184" size="32"/>
			</blobs>
		</layer>
		<layer id="4" name="MobilenetV2/expanded_conv/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="MobilenetV2/expanded_conv/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1216" size="256"/>
				<biases offset="1472" size="16"/>
			</blobs>
		</layer>
		<layer id="6" name="MobilenetV2/expanded_conv_1/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1488" size="768"/>
				<biases offset="2256" size="96"/>
			</blobs>
		</layer>
		<layer id="7" name="MobilenetV2/expanded_conv_1/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="MobilenetV2/expanded_conv_1/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="48" kernel="3,3" output="48" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2352" size="864"/>
				<biases offset="3216" size="96"/>
			</blobs>
		</layer>
		<layer id="9" name="MobilenetV2/expanded_conv_1/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="MobilenetV2/expanded_conv_1/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3312" size="1536"/>
				<biases offset="4848" size="32"/>
			</blobs>
		</layer>
		<layer id="11" name="MobilenetV2/expanded_conv_2/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4880" size="3072"/>
				<biases offset="7952" size="192"/>
			</blobs>
		</layer>
		<layer id="12" name="MobilenetV2/expanded_conv_2/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="MobilenetV2/expanded_conv_2/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="96" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8144" size="1728"/>
				<biases offset="9872" size="192"/>
			</blobs>
		</layer>
		<layer id="14" name="MobilenetV2/expanded_conv_2/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="MobilenetV2/expanded_conv_2/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="10064" size="3072"/>
				<biases offset="13136" size="32"/>
			</blobs>
		</layer>
		<layer id="16" name="MobilenetV2/expanded_conv_2/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="MobilenetV2/expanded_conv_3/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="13168" size="3072"/>
				<biases offset="16240" size="192"/>
			</blobs>
		</layer>
		<layer id="18" name="MobilenetV2/expanded_conv_3/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="MobilenetV2/expanded_conv_3/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="96" kernel="3,3" output="96" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="16432" size="1728"/>
				<biases offset="18160" size="192"/>
			</blobs>
		</layer>
		<layer id="20" name="MobilenetV2/expanded_conv_3/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="MobilenetV2/expanded_conv_3/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="18352" size="3072"/>
				<biases offset="21424" size="32"/>
			</blobs>
		</layer>
		<layer id="22" name="MobilenetV2/expanded_conv_4/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="21456" size="3072"/>
				<biases offset="24528" size="192"/>
			</blobs>
		</layer>
		<layer id="23" name="MobilenetV2/expanded_conv_4/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="MobilenetV2/expanded_conv_4/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="96" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="24720" size="1728"/>
				<biases offset="26448" size="192"/>
			</blobs>
		</layer>
		<layer id="25" name="MobilenetV2/expanded_conv_4/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="MobilenetV2/expanded_conv_4/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="26640" size="3072"/>
				<biases offset="29712" size="32"/>
			</blobs>
		</layer>
		<layer id="27" name="MobilenetV2/expanded_conv_4/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="MobilenetV2/expanded_conv_5/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="29744" size="3072"/>
				<biases offset="32816" size="192"/>
			</blobs>
		</layer>
		<layer id="29" name="MobilenetV2/expanded_conv_5/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="MobilenetV2/expanded_conv_5/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="96" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="33008" size="1728"/>
				<biases offset="34736" size="192"/>
			</blobs>
		</layer>
		<layer id="31" name="MobilenetV2/expanded_conv_5/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="MobilenetV2/expanded_conv_5/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="34928" size="3072"/>
				<biases offset="38000" size="32"/>
			</blobs>
		</layer>
		<layer id="33" name="MobilenetV2/expanded_conv_5/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="MobilenetV2/expanded_conv_6/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="38032" size="3072"/>
				<biases offset="41104" size="192"/>
			</blobs>
		</layer>
		<layer id="35" name="MobilenetV2/expanded_conv_6/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="MobilenetV2/expanded_conv_6/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="96" kernel="3,3" output="96" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="41296" size="1728"/>
				<biases offset="43024" size="192"/>
			</blobs>
		</layer>
		<layer id="37" name="MobilenetV2/expanded_conv_6/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="MobilenetV2/expanded_conv_6/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="43216" size="6144"/>
				<biases offset="49360" size="64"/>
			</blobs>
		</layer>
		<layer id="39" name="MobilenetV2/expanded_conv_7/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="49424" size="12288"/>
				<biases offset="61712" size="384"/>
			</blobs>
		</layer>
		<layer id="40" name="MobilenetV2/expanded_conv_7/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="MobilenetV2/expanded_conv_7/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="62096" size="3456"/>
				<biases offset="65552" size="384"/>
			</blobs>
		</layer>
		<layer id="42" name="MobilenetV2/expanded_conv_7/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="MobilenetV2/expanded_conv_7/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="65936" size="12288"/>
				<biases offset="78224" size="64"/>
			</blobs>
		</layer>
		<layer id="44" name="MobilenetV2/expanded_conv_7/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="MobilenetV2/expanded_conv_8/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="78288" size="12288"/>
				<biases offset="90576" size="384"/>
			</blobs>
		</layer>
		<layer id="46" name="MobilenetV2/expanded_conv_8/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="MobilenetV2/expanded_conv_8/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="90960" size="3456"/>
				<biases offset="94416" size="384"/>
			</blobs>
		</layer>
		<layer id="48" name="MobilenetV2/expanded_conv_8/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="MobilenetV2/expanded_conv_8/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="94800" size="12288"/>
				<biases offset="107088" size="64"/>
			</blobs>
		</layer>
		<layer id="50" name="MobilenetV2/expanded_conv_8/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="MobilenetV2/expanded_conv_9/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="107152" size="12288"/>
				<biases offset="119440" size="384"/>
			</blobs>
		</layer>
		<layer id="52" name="MobilenetV2/expanded_conv_9/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="MobilenetV2/expanded_conv_9/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="119824" size="3456"/>
				<biases offset="123280" size="384"/>
			</blobs>
		</layer>
		<layer id="54" name="MobilenetV2/expanded_conv_9/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="MobilenetV2/expanded_conv_9/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="123664" size="12288"/>
				<biases offset="135952" size="64"/>
			</blobs>
		</layer>
		<layer id="56" name="MobilenetV2/expanded_conv_9/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="MobilenetV2/expanded_conv_10/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="136016" size="12288"/>
				<biases offset="148304" size="384"/>
			</blobs>
		</layer>
		<layer id="58" name="MobilenetV2/expanded_conv_10/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="MobilenetV2/expanded_conv_10/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="148688" size="3456"/>
				<biases offset="152144" size="384"/>
			</blobs>
		</layer>
		<layer id="60" name="MobilenetV2/expanded_conv_10/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="MobilenetV2/expanded_conv_10/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="152528" size="18432"/>
				<biases offset="170960" size="96"/>
			</blobs>
		</layer>
		<layer id="62" name="MobilenetV2/expanded_conv_11/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="288" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="171056" size="27648"/>
				<biases offset="198704" size="576"/>
			</blobs>
		</layer>
		<layer id="63" name="MobilenetV2/expanded_conv_11/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="MobilenetV2/expanded_conv_11/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="288" kernel="3,3" output="288" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="199280" size="5184"/>
				<biases offset="204464" size="576"/>
			</blobs>
		</layer>
		<layer id="65" name="MobilenetV2/expanded_conv_11/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="MobilenetV2/expanded_conv_11/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="205040" size="27648"/>
				<biases offset="232688" size="96"/>
			</blobs>
		</layer>
		<layer id="67" name="MobilenetV2/expanded_conv_11/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="MobilenetV2/expanded_conv_12/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="288" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="232784" size="27648"/>
				<biases offset="260432" size="576"/>
			</blobs>
		</layer>
		<layer id="69" name="MobilenetV2/expanded_conv_12/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="MobilenetV2/expanded_conv_12/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="288" kernel="3,3" output="288" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="261008" size="5184"/>
				<biases offset="266192" size="576"/>
			</blobs>
		</layer>
		<layer id="71" name="MobilenetV2/expanded_conv_12/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="MobilenetV2/expanded_conv_12/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="266768" size="27648"/>
				<biases offset="294416" size="96"/>
			</blobs>
		</layer>
		<layer id="73" name="MobilenetV2/expanded_conv_12/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="base/layer_14/output/upsample" precision="FP16" type="Interp">
			<data align_corners="0" factor="2.0" pad_beg="0" pad_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="feat_concat" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Openpose/MConv_Stage1_L1_1_depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="294512" size="1152"/>
			</blobs>
		</layer>
		<layer id="77" name="Openpose/MConv_Stage1_L1_1_pointwise/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="295664" size="8192"/>
				<biases offset="303856" size="128"/>
			</blobs>
		</layer>
		<layer id="78" name="Openpose/MConv_Stage1_L1_1_pointwise/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Openpose/MConv_Stage1_L1_2_depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="303984" size="1152"/>
			</blobs>
		</layer>
		<layer id="80" name="Openpose/MConv_Stage1_L1_2_pointwise/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="305136" size="8192"/>
				<biases offset="313328" size="128"/>
			</blobs>
		</layer>
		<layer id="81" name="Openpose/MConv_Stage1_L1_2_pointwise/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Openpose/MConv_Stage1_L1_3_depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="313456" size="1152"/>
			</blobs>
		</layer>
		<layer id="83" name="Openpose/MConv_Stage1_L1_3_pointwise/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="314608" size="8192"/>
				<biases offset="322800" size="128"/>
			</blobs>
		</layer>
		<layer id="84" name="Openpose/MConv_Stage1_L1_3_pointwise/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Openpose/MConv_Stage1_L1_4_depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="64" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="322928" size="128"/>
			</blobs>
		</layer>
		<layer id="86" name="Openpose/MConv_Stage1_L1_4_pointwise/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="323056" size="32768"/>
				<biases offset="355824" size="512"/>
			</blobs>
		</layer>
		<layer id="87" name="Openpose/MConv_Stage1_L1_4_pointwise/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Openpose/MConv_Stage1_L1_5_depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="256" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="356336" size="512"/>
			</blobs>
		</layer>
		<layer id="89" name="Openpose/MConv_Stage1_L1_5_pointwise/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="38" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>38</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="356848" size="19456"/>
				<biases offset="376304" size="76"/>
			</blobs>
		</layer>
		<layer id="90" name="Openpose/MConv_Stage1_L2_1_depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="376380" size="1152"/>
			</blobs>
		</layer>
		<layer id="91" name="Openpose/MConv_Stage1_L2_1_pointwise/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="377532" size="8192"/>
				<biases offset="385724" size="128"/>
			</blobs>
		</layer>
		<layer id="92" name="Openpose/MConv_Stage1_L2_1_pointwise/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Openpose/MConv_Stage1_L2_2_depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="385852" size="1152"/>
			</blobs>
		</layer>
		<layer id="94" name="Openpose/MConv_Stage1_L2_2_pointwise/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="387004" size="8192"/>
				<biases offset="395196" size="128"/>
			</blobs>
		</layer>
		<layer id="95" name="Openpose/MConv_Stage1_L2_2_pointwise/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Openpose/MConv_Stage1_L2_3_depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>46</dim>
