<?xml version="1.0" ?>
<net batch="1" name="frozen-model" version="5">
	<layers>
		<layer id="0" name="image" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>368</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="MobilenetV2/Conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="48" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>368</dim>
					<dim>432</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="2592"/>
				<biases offset="2592" size="96"/>
			</blobs>
		</layer>
		<layer id="2" name="MobilenetV2/Conv/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="MobilenetV2/expanded_conv/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="48" kernel="3,3" output="48" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2688" size="864"/>
				<biases offset="3552" size="96"/>
			</blobs>
		</layer>
		<layer id="4" name="MobilenetV2/expanded_conv/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="MobilenetV2/expanded_conv/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3648" size="2304"/>
				<biases offset="5952" size="48"/>
			</blobs>
		</layer>
		<layer id="6" name="MobilenetV2/expanded_conv_1/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6000" size="6912"/>
				<biases offset="12912" size="288"/>
			</blobs>
		</layer>
		<layer id="7" name="MobilenetV2/expanded_conv_1/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="MobilenetV2/expanded_conv_1/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="13200" size="2592"/>
				<biases offset="15792" size="288"/>
			</blobs>
		</layer>
		<layer id="9" name="MobilenetV2/expanded_conv_1/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="MobilenetV2/expanded_conv_1/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="16080" size="9216"/>
				<biases offset="25296" size="64"/>
			</blobs>
		</layer>
		<layer id="11" name="MobilenetV2/expanded_conv_2/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="25360" size="12288"/>
				<biases offset="37648" size="384"/>
			</blobs>
		</layer>
		<layer id="12" name="MobilenetV2/expanded_conv_2/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="MobilenetV2/expanded_conv_2/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="38032" size="3456"/>
				<biases offset="41488" size="384"/>
			</blobs>
		</layer>
		<layer id="14" name="MobilenetV2/expanded_conv_2/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="MobilenetV2/expanded_conv_2/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="41872" size="12288"/>
				<biases offset="54160" size="64"/>
			</blobs>
		</layer>
		<layer id="16" name="MobilenetV2/expanded_conv_2/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="MobilenetV2/expanded_conv_3/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="54224" size="12288"/>
				<biases offset="66512" size="384"/>
			</blobs>
		</layer>
		<layer id="18" name="MobilenetV2/expanded_conv_3/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="MobilenetV2/expanded_conv_3/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="66896" size="3456"/>
				<biases offset="70352" size="384"/>
			</blobs>
		</layer>
		<layer id="20" name="MobilenetV2/expanded_conv_3/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="MobilenetV2/expanded_conv_3/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="70736" size="18432"/>
				<biases offset="89168" size="96"/>
			</blobs>
		</layer>
		<layer id="22" name="MobilenetV2/expanded_conv_4/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="288" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="89264" size="27648"/>
				<biases offset="116912" size="576"/>
			</blobs>
		</layer>
		<layer id="23" name="MobilenetV2/expanded_conv_4/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="MobilenetV2/expanded_conv_4/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="288" kernel="3,3" output="288" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="117488" size="5184"/>
				<biases offset="122672" size="576"/>
			</blobs>
		</layer>
		<layer id="25" name="MobilenetV2/expanded_conv_4/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="MobilenetV2/expanded_conv_4/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="123248" size="27648"/>
				<biases offset="150896" size="96"/>
			</blobs>
		</layer>
		<layer id="27" name="MobilenetV2/expanded_conv_4/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="MobilenetV2/expanded_conv_5/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="288" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="150992" size="27648"/>
				<biases offset="178640" size="576"/>
			</blobs>
		</layer>
		<layer id="29" name="MobilenetV2/expanded_conv_5/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="MobilenetV2/expanded_conv_5/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="288" kernel="3,3" output="288" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="179216" size="5184"/>
				<biases offset="184400" size="576"/>
			</blobs>
		</layer>
		<layer id="31" name="MobilenetV2/expanded_conv_5/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="MobilenetV2/expanded_conv_5/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="184976" size="27648"/>
				<biases offset="212624" size="96"/>
			</blobs>
		</layer>
		<layer id="33" name="MobilenetV2/expanded_conv_5/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="MobilenetV2/expanded_conv_6/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="288" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="212720" size="27648"/>
				<biases offset="240368" size="576"/>
			</blobs>
		</layer>
		<layer id="35" name="MobilenetV2/expanded_conv_6/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="MobilenetV2/expanded_conv_6/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="288" kernel="3,3" output="288" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="240944" size="5184"/>
				<biases offset="246128" size="576"/>
			</blobs>
		</layer>
		<layer id="37" name="MobilenetV2/expanded_conv_6/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="MobilenetV2/expanded_conv_6/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="88" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="246704" size="50688"/>
				<biases offset="297392" size="176"/>
			</blobs>
		</layer>
		<layer id="39" name="MobilenetV2/expanded_conv_7/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="528" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="297568" size="92928"/>
				<biases offset="390496" size="1056"/>
			</blobs>
		</layer>
		<layer id="40" name="MobilenetV2/expanded_conv_7/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="MobilenetV2/expanded_conv_7/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="528" kernel="3,3" output="528" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="391552" size="9504"/>
				<biases offset="401056" size="1056"/>
			</blobs>
		</layer>
		<layer id="42" name="MobilenetV2/expanded_conv_7/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="MobilenetV2/expanded_conv_7/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="88" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="402112" size="92928"/>
				<biases offset="495040" size="176"/>
			</blobs>
		</layer>
		<layer id="44" name="MobilenetV2/expanded_conv_7/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="MobilenetV2/expanded_conv_8/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="528" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="495216" size="92928"/>
				<biases offset="588144" size="1056"/>
			</blobs>
		</layer>
		<layer id="46" name="MobilenetV2/expanded_conv_8/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="MobilenetV2/expanded_conv_8/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="528" kernel="3,3" output="528" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="589200" size="9504"/>
				<biases offset="598704" size="1056"/>
			</blobs>
		</layer>
		<layer id="48" name="MobilenetV2/expanded_conv_8/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="MobilenetV2/expanded_conv_8/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="88" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="599760" size="92928"/>
				<biases offset="692688" size="176"/>
			</blobs>
		</layer>
		<layer id="50" name="MobilenetV2/expanded_conv_8/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="MobilenetV2/expanded_conv_9/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="528" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="692864" size="92928"/>
				<biases offset="785792" size="1056"/>
			</blobs>
		</layer>
		<layer id="52" name="MobilenetV2/expanded_conv_9/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="MobilenetV2/expanded_conv_9/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="528" kernel="3,3" output="528" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="786848" size="9504"/>
				<biases offset="796352" size="1056"/>
			</blobs>
		</layer>
		<layer id="54" name="MobilenetV2/expanded_conv_9/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="MobilenetV2/expanded_conv_9/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="88" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="797408" size="92928"/>
				<biases offset="890336" size="176"/>
			</blobs>
		</layer>
		<layer id="56" name="MobilenetV2/expanded_conv_9/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="MobilenetV2/expanded_conv_10/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="528" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="890512" size="92928"/>
				<biases offset="983440" size="1056"/>
			</blobs>
		</layer>
		<layer id="58" name="MobilenetV2/expanded_conv_10/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="MobilenetV2/expanded_conv_10/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="528" kernel="3,3" output="528" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="984496" size="9504"/>
				<biases offset="994000" size="1056"/>
			</blobs>
		</layer>
		<layer id="60" name="MobilenetV2/expanded_conv_10/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="MobilenetV2/expanded_conv_10/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="136" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="995056" size="143616"/>
				<biases offset="1138672" size="272"/>
			</blobs>
		</layer>
		<layer id="62" name="MobilenetV2/expanded_conv_11/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="816" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1138944" size="221952"/>
				<biases offset="1360896" size="1632"/>
			</blobs>
		</layer>
		<layer id="63" name="MobilenetV2/expanded_conv_11/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="MobilenetV2/expanded_conv_11/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="816" kernel="3,3" output="816" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1362528" size="14688"/>
				<biases offset="1377216" size="1632"/>
			</blobs>
		</layer>
		<layer id="65" name="MobilenetV2/expanded_conv_11/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="MobilenetV2/expanded_conv_11/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="136" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1378848" size="221952"/>
				<biases offset="1600800" size="272"/>
			</blobs>
		</layer>
		<layer id="67" name="MobilenetV2/expanded_conv_11/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="MobilenetV2/expanded_conv_12/expand/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="816" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1601072" size="221952"/>
				<biases offset="1823024" size="1632"/>
			</blobs>
		</layer>
		<layer id="69" name="MobilenetV2/expanded_conv_12/expand/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="MobilenetV2/expanded_conv_12/depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="816" kernel="3,3" output="816" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1824656" size="14688"/>
				<biases offset="1839344" size="1632"/>
			</blobs>
		</layer>
		<layer id="71" name="MobilenetV2/expanded_conv_12/depthwise/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="MobilenetV2/expanded_conv_12/project/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="136" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1840976" size="221952"/>
				<biases offset="2062928" size="272"/>
			</blobs>
		</layer>
		<layer id="73" name="MobilenetV2/expanded_conv_12/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="base/layer_14/output/upsample" precision="FP16" type="Interp">
			<data align_corners="0" factor="2.0" pad_beg="0" pad_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>136</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="feat_concat" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>136</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>184</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Openpose/MConv_Stage1_L1_1_depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="184" kernel="3,3" output="184" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>184</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>184</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2063200" size="3312"/>
			</blobs>
		</layer>
		<layer id="77" name="Openpose/MConv_Stage1_L1_1_pointwise/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>184</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2066512" size="47104"/>
				<biases offset="2113616" size="256"/>
			</blobs>
		</layer>
		<layer id="78" name="Openpose/MConv_Stage1_L1_1_pointwise/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Openpose/MConv_Stage1_L1_2_depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="128" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2113872" size="2304"/>
			</blobs>
		</layer>
		<layer id="80" name="Openpose/MConv_Stage1_L1_2_pointwise/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2116176" size="32768"/>
				<biases offset="2148944" size="256"/>
			</blobs>
		</layer>
		<layer id="81" name="Openpose/MConv_Stage1_L1_2_pointwise/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Openpose/MConv_Stage1_L1_3_depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="128" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2149200" size="2304"/>
			</blobs>
		</layer>
		<layer id="83" name="Openpose/MConv_Stage1_L1_3_pointwise/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2151504" size="32768"/>
				<biases offset="2184272" size="256"/>
			</blobs>
		</layer>
		<layer id="84" name="Openpose/MConv_Stage1_L1_3_pointwise/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Openpose/MConv_Stage1_L1_4_depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="128" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2184528" size="256"/>
			</blobs>
		</layer>
		<layer id="86" name="Openpose/MConv_Stage1_L1_4_pointwise/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2184784" size="131072"/>
				<biases offset="2315856" size="1024"/>
			</blobs>
		</layer>
		<layer id="87" name="Openpose/MConv_Stage1_L1_4_pointwise/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Openpose/MConv_Stage1_L1_5_depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="512" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2316880" size="1024"/>
			</blobs>
		</layer>
		<layer id="89" name="Openpose/MConv_Stage1_L1_5_pointwise/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="38" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>38</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2317904" size="38912"/>
				<biases offset="2356816" size="76"/>
			</blobs>
		</layer>
		<layer id="90" name="Openpose/MConv_Stage1_L2_1_depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="184" kernel="3,3" output="184" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>184</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>184</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2356892" size="3312"/>
			</blobs>
		</layer>
		<layer id="91" name="Openpose/MConv_Stage1_L2_1_pointwise/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>184</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2360204" size="47104"/>
				<biases offset="2407308" size="256"/>
			</blobs>
		</layer>
		<layer id="92" name="Openpose/MConv_Stage1_L2_1_pointwise/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Openpose/MConv_Stage1_L2_2_depthwise/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="128" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2407564" size="2304"/>
			</blobs>
		</layer>
		<layer id="94" name="Openpose/MConv_Stage1_L2_2_pointwise/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2409868" size="32768"/>
				<biases offset="2442636" size="256"/>
			</blobs>
		</layer>
		<layer id="95" name="Openpose/MConv_Stage1_L2_2_pointwise/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
