<?xml version="1.0" ?>
<net batch="1" name="frozen-model" version="5">
	<layers>
		<layer id="0" name="image" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>368</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="MobilenetV2/Conv/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="48" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>368</dim>
					<dim>432</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="5184"/>
				<biases offset="5184" size="192"/>
			</blobs>
		</layer>
		<layer id="2" name="MobilenetV2/Conv/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="MobilenetV2/expanded_conv/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="48" kernel="3,3" output="48" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5376" size="1728"/>
				<biases offset="7104" size="192"/>
			</blobs>
		</layer>
		<layer id="4" name="MobilenetV2/expanded_conv/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="MobilenetV2/expanded_conv/project/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7296" size="4608"/>
				<biases offset="11904" size="96"/>
			</blobs>
		</layer>
		<layer id="6" name="MobilenetV2/expanded_conv_1/expand/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12000" size="13824"/>
				<biases offset="25824" size="576"/>
			</blobs>
		</layer>
		<layer id="7" name="MobilenetV2/expanded_conv_1/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="MobilenetV2/expanded_conv_1/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="26400" size="5184"/>
				<biases offset="31584" size="576"/>
			</blobs>
		</layer>
		<layer id="9" name="MobilenetV2/expanded_conv_1/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="MobilenetV2/expanded_conv_1/project/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="32160" size="18432"/>
				<biases offset="50592" size="128"/>
			</blobs>
		</layer>
		<layer id="11" name="MobilenetV2/expanded_conv_2/expand/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="50720" size="24576"/>
				<biases offset="75296" size="768"/>
			</blobs>
		</layer>
		<layer id="12" name="MobilenetV2/expanded_conv_2/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="MobilenetV2/expanded_conv_2/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="76064" size="6912"/>
				<biases offset="82976" size="768"/>
			</blobs>
		</layer>
		<layer id="14" name="MobilenetV2/expanded_conv_2/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="MobilenetV2/expanded_conv_2/project/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="83744" size="24576"/>
				<biases offset="108320" size="128"/>
			</blobs>
		</layer>
		<layer id="16" name="MobilenetV2/expanded_conv_2/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="MobilenetV2/expanded_conv_3/expand/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
			<blobs>
				<weights offset="108448" size="24576"/>
				<biases offset="133024" size="768"/>
			</blobs>
		</layer>
		<layer id="18" name="MobilenetV2/expanded_conv_3/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="MobilenetV2/expanded_conv_3/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="133792" size="6912"/>
				<biases offset="140704" size="768"/>
			</blobs>
		</layer>
		<layer id="20" name="MobilenetV2/expanded_conv_3/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="MobilenetV2/expanded_conv_3/project/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="141472" size="36864"/>
				<biases offset="178336" size="192"/>
			</blobs>
		</layer>
		<layer id="22" name="MobilenetV2/expanded_conv_4/expand/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="288" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="178528" size="55296"/>
				<biases offset="233824" size="1152"/>
			</blobs>
		</layer>
		<layer id="23" name="MobilenetV2/expanded_conv_4/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="MobilenetV2/expanded_conv_4/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="288" kernel="3,3" output="288" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="234976" size="10368"/>
				<biases offset="245344" size="1152"/>
			</blobs>
		</layer>
		<layer id="25" name="MobilenetV2/expanded_conv_4/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="MobilenetV2/expanded_conv_4/project/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="246496" size="55296"/>
				<biases offset="301792" size="192"/>
			</blobs>
		</layer>
		<layer id="27" name="MobilenetV2/expanded_conv_4/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="MobilenetV2/expanded_conv_5/expand/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="288" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="301984" size="55296"/>
				<biases offset="357280" size="1152"/>
			</blobs>
		</layer>
		<layer id="29" name="MobilenetV2/expanded_conv_5/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="MobilenetV2/expanded_conv_5/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="288" kernel="3,3" output="288" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="358432" size="10368"/>
				<biases offset="368800" size="1152"/>
			</blobs>
		</layer>
		<layer id="31" name="MobilenetV2/expanded_conv_5/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="MobilenetV2/expanded_conv_5/project/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="369952" size="55296"/>
				<biases offset="425248" size="192"/>
			</blobs>
		</layer>
		<layer id="33" name="MobilenetV2/expanded_conv_5/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="MobilenetV2/expanded_conv_6/expand/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="288" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="425440" size="55296"/>
				<biases offset="480736" size="1152"/>
			</blobs>
		</layer>
		<layer id="35" name="MobilenetV2/expanded_conv_6/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="MobilenetV2/expanded_conv_6/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="288" kernel="3,3" output="288" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="481888" size="10368"/>
				<biases offset="492256" size="1152"/>
			</blobs>
		</layer>
		<layer id="37" name="MobilenetV2/expanded_conv_6/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="MobilenetV2/expanded_conv_6/project/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="88" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="493408" size="101376"/>
				<biases offset="594784" size="352"/>
			</blobs>
		</layer>
		<layer id="39" name="MobilenetV2/expanded_conv_7/expand/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="528" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="595136" size="185856"/>
				<biases offset="780992" size="2112"/>
			</blobs>
		</layer>
		<layer id="40" name="MobilenetV2/expanded_conv_7/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="MobilenetV2/expanded_conv_7/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="528" kernel="3,3" output="528" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="783104" size="19008"/>
				<biases offset="802112" size="2112"/>
			</blobs>
		</layer>
		<layer id="42" name="MobilenetV2/expanded_conv_7/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="MobilenetV2/expanded_conv_7/project/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="88" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="804224" size="185856"/>
				<biases offset="990080" size="352"/>
			</blobs>
		</layer>
		<layer id="44" name="MobilenetV2/expanded_conv_7/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="MobilenetV2/expanded_conv_8/expand/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="528" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="990432" size="185856"/>
				<biases offset="1176288" size="2112"/>
			</blobs>
		</layer>
		<layer id="46" name="MobilenetV2/expanded_conv_8/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="MobilenetV2/expanded_conv_8/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="528" kernel="3,3" output="528" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1178400" size="19008"/>
				<biases offset="1197408" size="2112"/>
			</blobs>
		</layer>
		<layer id="48" name="MobilenetV2/expanded_conv_8/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="MobilenetV2/expanded_conv_8/project/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="88" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1199520" size="185856"/>
				<biases offset="1385376" size="352"/>
			</blobs>
		</layer>
		<layer id="50" name="MobilenetV2/expanded_conv_8/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="MobilenetV2/expanded_conv_9/expand/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="528" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1385728" size="185856"/>
				<biases offset="1571584" size="2112"/>
			</blobs>
		</layer>
		<layer id="52" name="MobilenetV2/expanded_conv_9/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="MobilenetV2/expanded_conv_9/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="528" kernel="3,3" output="528" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1573696" size="19008"/>
				<biases offset="1592704" size="2112"/>
			</blobs>
		</layer>
		<layer id="54" name="MobilenetV2/expanded_conv_9/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="MobilenetV2/expanded_conv_9/project/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="88" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1594816" size="185856"/>
				<biases offset="1780672" size="352"/>
			</blobs>
		</layer>
		<layer id="56" name="MobilenetV2/expanded_conv_9/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="MobilenetV2/expanded_conv_10/expand/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="528" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1781024" size="185856"/>
				<biases offset="1966880" size="2112"/>
			</blobs>
		</layer>
		<layer id="58" name="MobilenetV2/expanded_conv_10/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="MobilenetV2/expanded_conv_10/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="528" kernel="3,3" output="528" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1968992" size="19008"/>
				<biases offset="1988000" size="2112"/>
			</blobs>
		</layer>
		<layer id="60" name="MobilenetV2/expanded_conv_10/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="MobilenetV2/expanded_conv_10/project/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="136" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>528</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1990112" size="287232"/>
				<biases offset="2277344" size="544"/>
			</blobs>
		</layer>
		<layer id="62" name="MobilenetV2/expanded_conv_11/expand/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="816" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2277888" size="443904"/>
				<biases offset="2721792" size="3264"/>
			</blobs>
		</layer>
		<layer id="63" name="MobilenetV2/expanded_conv_11/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="MobilenetV2/expanded_conv_11/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="816" kernel="3,3" output="816" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2725056" size="29376"/>
				<biases offset="2754432" size="3264"/>
			</blobs>
		</layer>
		<layer id="65" name="MobilenetV2/expanded_conv_11/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="MobilenetV2/expanded_conv_11/project/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="136" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2757696" size="443904"/>
				<biases offset="3201600" size="544"/>
			</blobs>
		</layer>
		<layer id="67" name="MobilenetV2/expanded_conv_11/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="MobilenetV2/expanded_conv_12/expand/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="816" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3202144" size="443904"/>
				<biases offset="3646048" size="3264"/>
			</blobs>
		</layer>
		<layer id="69" name="MobilenetV2/expanded_conv_12/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="MobilenetV2/expanded_conv_12/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="816" kernel="3,3" output="816" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3649312" size="29376"/>
				<biases offset="3678688" size="3264"/>
			</blobs>
		</layer>
		<layer id="71" name="MobilenetV2/expanded_conv_12/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="MobilenetV2/expanded_conv_12/project/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="136" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>816</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3681952" size="443904"/>
				<biases offset="4125856" size="544"/>
			</blobs>
		</layer>
		<layer id="73" name="MobilenetV2/expanded_conv_12/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="base/layer_14/output/upsample" precision="FP32" type="Interp">
			<data align_corners="0" factor="2.0" pad_beg="0" pad_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>136</dim>
					<dim>23</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>136</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="feat_concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>136</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>184</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Openpose/MConv_Stage1_L1_1_depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="184" kernel="3,3" output="184" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>184</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>184</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4126400" size="6624"/>
			</blobs>
		</layer>
		<layer id="77" name="Openpose/MConv_Stage1_L1_1_pointwise/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>184</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4133024" size="94208"/>
				<biases offset="4227232" size="512"/>
			</blobs>
		</layer>
		<layer id="78" name="Openpose/MConv_Stage1_L1_1_pointwise/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Openpose/MConv_Stage1_L1_2_depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="128" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4227744" size="4608"/>
			</blobs>
		</layer>
		<layer id="80" name="Openpose/MConv_Stage1_L1_2_pointwise/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4232352" size="65536"/>
				<biases offset="4297888" size="512"/>
			</blobs>
		</layer>
		<layer id="81" name="Openpose/MConv_Stage1_L1_2_pointwise/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Openpose/MConv_Stage1_L1_3_depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="128" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4298400" size="4608"/>
			</blobs>
		</layer>
		<layer id="83" name="Openpose/MConv_Stage1_L1_3_pointwise/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4303008" size="65536"/>
				<biases offset="4368544" size="512"/>
			</blobs>
		</layer>
		<layer id="84" name="Openpose/MConv_Stage1_L1_3_pointwise/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Openpose/MConv_Stage1_L1_4_depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="128" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4369056" size="512"/>
			</blobs>
		</layer>
		<layer id="86" name="Openpose/MConv_Stage1_L1_4_pointwise/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4369568" size="262144"/>
				<biases offset="4631712" size="2048"/>
			</blobs>
		</layer>
		<layer id="87" name="Openpose/MConv_Stage1_L1_4_pointwise/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Openpose/MConv_Stage1_L1_5_depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="512" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4633760" size="2048"/>
			</blobs>
		</layer>
		<layer id="89" name="Openpose/MConv_Stage1_L1_5_pointwise/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="38" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>38</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4635808" size="77824"/>
				<biases offset="4713632" size="152"/>
			</blobs>
		</layer>
		<layer id="90" name="Openpose/MConv_Stage1_L2_1_depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="184" kernel="3,3" output="184" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>184</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>184</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4713784" size="6624"/>
			</blobs>
		</layer>
		<layer id="91" name="Openpose/MConv_Stage1_L2_1_pointwise/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>184</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4720408" size="94208"/>
				<biases offset="4814616" size="512"/>
			</blobs>
		</layer>
		<layer id="92" name="Openpose/MConv_Stage1_L2_1_pointwise/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Openpose/MConv_Stage1_L2_2_depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="128" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4815128" size="4608"/>
			</blobs>
		</layer>
		<layer id="94" name="Openpose/MConv_Stage1_L2_2_pointwise/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4819736" size="65536"/>
				<biases offset="4885272" size="512"/>
			</blobs>
		</layer>
		<layer id="95" name="Openpose/MConv_Stage1_L2_2_pointwise/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
